a=[{'商品1，商品2，商品3，商品4'}, {'商品3，商品2，商品4，商品5'}, {'商品1，商品5，商品3，商品6'}, {'商品1，商品4，商品3，商品7'}, {'商品1，商品2，商品3，商品8'}, {'商品5，商品7，商品3，商品9'}, {'商品1，商品4，商品6，商品7'}, {'商品1，商品4，商品3，商品8'}, {'商品5，商品4，商品3，商品9'}, {'商品1，商品4，商品5，商品10'}, {'商品1，商品4，商品3，商品11'}, {'商品7，商品4，商品9，商品12'}, {'商品1，商品7，商品3，商品13'}, {'商品10，商品4，商品9，商品14'}, {'商品1，商品8，商品11，商品15'}, {'商品14，商品4，商品13，商品16'}, {'商品3，商品4，商品9'}, {'商品3，商品4，商品10'}]
b={'商品1'}
for i in a:
    print(b in i)
# 冒泡排序
def bubble_sort(alist):
    for i in range(len(alist)-1,0,-1):
        for j in range(i):
            if alist[j]>alist[j+1]:
                alist[j],alist[j+1]=alist[j+1],alist[j]
    return alist        # 返回排序后的列表  alist是列表 alist[j]是列表中的元素  alist[j+1]是列表中的元素    alist[j]>alist[j+1]是判断是否需要交换

bubble_sort([1,3,5,7,9,2,4,6,8,0])
